cf/InformationRegisters/ProcessesToStart.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ProcessesToStart</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>DeferredStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProcessesStatesForStart</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>StartCancelReason</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Owner</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.DeferredBusinessProcess</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ProcessesStatesForStart.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ProcessesStatesForStart</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ReadyToStart</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>StartCanceled</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/InformationRegisters/ProcessesToStart/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// Adds information about successful process start.
//
// Parameters:
//   - BusinessProcess - BusinessProcessRef.
//
Procedure RegisterProcessStart(Process_) Export
	
	Record = CreateRecordManager();
	Record.Owner = Process_;
	Record.Read();
	
	If Not Record.Selected() Then
		Return;
	EndIf;
	
	Record.Delete();
	
EndProcedure

// Adds information about process start cancellation.
//
// Parameters:
//   - BusinessProcess - BusinessProcessRef.
//
Procedure RegisterStartCancellation(Process_, CancellationReason) Export
	
	Record = CreateRecordManager();
	Record.Owner = Process_;
	Record.Read();
	
	If Not Record.Selected() Then
		Return;
	EndIf;
	
	Record.State = Enums.ProcessesStatesForStart.StartCanceled;
	Record.StartCancelReason = CancellationReason;
	
	Record.Write();
	
EndProcedure

#EndRegion

#EndIf
